n5/src/Documents/Waybill/Waybill.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Waybill</name>
  <registerRecords>AccumulationRegister.FuelExcess</registerRecords>
  <registerRecords>AccumulationRegister.WaybillWorks</registerRecords>
  <registerRecords>AccumulationRegister.FuelToExpense</registerRecords>
  <registerRecords>AccumulationRegister.WaybillWorksByWorkTypes</registerRecords>
  <registerRecords>AccumulationRegister.FuelExcessTurnovers</registerRecords>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalEquipmentsWork</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Car</name>
    <type>
      <types>CatalogRef.Cars</types>
    </type>
  </attributes>
  <attributes>
    <name>CoefficientCar</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CoefficientConsumption</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CoefficientTrailerI</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CoefficientTrailerII</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>DateOpening</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Dim1</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim2</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim3</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Driver1</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Driver2</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>EngineHoursAvg</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EngineHoursMax</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EngineHoursMin</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EquipmentWorkTime</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseEngineAvg</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseEngineMax</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseEngineMin</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseEquipment</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseOdometer</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FuelEquipment</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>FuelExpenseMethod</name>
    <type>
      <types>EnumRef.FuelExpenseMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>FuelHours</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>FuelInventory</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>FuelMain</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>FuelOther</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>MileageCity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MileageToWork</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MileageTrailerI</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MileageTrailerII</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MileageTrailerWithoutI</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MileageTrailerWithoutII</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MileageWithoutOdometer</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OdometerEnd</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OdometerStart</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OtherFuelExpense</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Product</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductFeature</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </attributes>
  <attributes>
    <name>QuantityTrips</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TotalMileage</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Trailer</name>
    <type>
      <types>CatalogRef.CarTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>WaybillNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WaybillSeries</name>
    <type>
      <types>DefinedType.ReferenceSeries</types>
    </type>
  </attributes>
  <attributes>
    <name>WaybillType</name>
    <type>
      <types>EnumRef.WaybillTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>WorkTime</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>FuelBalances</name>
    <attributes>
      <name>Fuel</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Trips</name>
    <attributes>
      <name>AdditionalEquipmentsWork</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CoefficientConsumption</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EquipmentWorkTime</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ExpenseOdometer</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Mileage</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MileageCargo</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OdometerEnd</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OdometerStart</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Trailer</name>
      <type>
        <types>CatalogRef.CarTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>TrailerWeight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Weight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Verso</name>
    <attributes>
      <name>Customer</name>
      <type>
        <types>CatalogRef.Organizations</types>
        <types>CatalogRef.Departments</types>
      </type>
    </attributes>
    <attributes>
      <name>CustomerDivision</name>
      <type>
        <types>CatalogRef.CustomerDivisions</types>
      </type>
    </attributes>
    <attributes>
      <name>DateEnd</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>DateStart</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>EngineHours</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Mileage</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OdometerEnd</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OdometerStart</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Work</name>
      <type>
        <types>EnumRef.CarWorkTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>WorkTime</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

n5/src/Documents/Waybill/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

var Realtime;
	
Procedure BeforeWrite ( Cancel, WriteMode, PostingMode )
	
	if ( DataExchange.Load ) then
		return;
	endif; 
	setProperties ();
	
EndProcedure

Procedure setProperties ()
	
	Realtime = Forms.RealtimePosting ( ThisObject );
	
EndProcedure 

Procedure FillCheckProcessing ( Cancel, CheckedAttributes )
	
	if ( not checkPeriod () ) then
		Cancel = true;
		return;
	endif;
	if ( waybillAlreadyExists () ) then
		Cancel = true;
		return;
	endif; 
	if ( not checkBoundary () ) then
		Cancel = true;
		return;
	endif; 
	if ( not checkVerso () ) then
		Cancel = true;
	endif; 
	checkFuelMain ( CheckedAttributes );
	checkFuelHours ( CheckedAttributes );
	checkFuelEquipment ( CheckedAttributes );
	checkFuelOther ( CheckedAttributes );
	checkAccount ( CheckedAttributes );

EndProcedure

Function checkPeriod ()
	
	if ( Periods.Ok ( DateOpening, Date ) ) then
		return true;
	endif; 
	Output.IncorrectDateOpening ();
	return false;
	
EndFunction 

Function waybillAlreadyExists ()
	
	s = "
	|select Waybill.Ref as Ref
	|from Document.Waybill as Waybill
	|where Waybill.Ref.Date between &DateStart and &DateEnd
	|and Waybill.Ref <> &Ref
	|and Waybill.Car = &Car
	|and Waybill.Posted
	|";
	q = new Query ( s );
	q.SetParameter ( "DateStart", BegOfDay ( DateOpening ) );
	q.SetParameter ( "DateEnd", EndOfDay ( Date ) );
	q.SetParameter ( "Ref", Ref );
	q.SetParameter ( "Car", Car );
	table = q.Execute ().Unload ();
	if ( table.Count () > 0 ) then
		for each row in table do
			p = new Structure ( "DateStart, DateEnd, Car, Document", Conversion.DateToString ( DateOpening ), Conversion.DateToString ( Date ), Car, row.Ref );
			Output.WrongWaybillPeriod ( p, , row.Ref );
		enddo;
		return true;
	endif;
	return false;
	
EndFunction 

Function checkBoundary ()
	
	lastIndex = Verso.Count () - 1;
	if ( lastIndex < 0 ) then
		return true;
	endif; 
	if ( BegOfDay ( Verso [ 0 ].DateStart ) < DateOpening ) then
		Output.BackSideIncorrectDateStart ( , Output.Row ( "BackSide", 1, "DateStart" ) );
		return false;
	endif; 
	if ( Verso [ lastIndex ].DateEnd > Date ) then
		Output.BackSideIncorrectDateEnd ( , Output.Row ( "BackSide", lastIndex + 1, "DateEnd" ) );
		return false;
	endif; 
	return true;
	
EndFunction 

Function checkVerso ()

	error = false;
	versoPresentation = Metadata.Documents.Waybill.TabularSections.Verso.Presentation ();
	for each row in Verso do
		if ( row.DateStart > row.DateEnd ) then
			p = new Structure ( "Table, LineNumber", versoPresentation, row.LineNumber );
			Output.WorkSequenceIncorrect ( p, Output.Row ( "Work", row.LineNumber, "DateStart" ) );
			error = true;
		endif; 
	enddo;
	return not error;
	
EndFunction 

Procedure checkFuelMain ( CheckedAttributes )
	
	if ( ExpenseOdometer <> 0 ) then
		CheckedAttributes.Add ( "FuelMain" );
	endif; 
	
EndProcedure 

Procedure checkFuelHours ( CheckedAttributes )
	
	if ( ExpenseEngineMax <> 0
		or ExpenseEngineAvg <> 0
		or ExpenseEngineMin <> 0
		or EngineHoursMax <> 0
		or EngineHoursAvg <> 0
		or EngineHoursMin <> 0 ) then
		CheckedAttributes.Add ( "FuelHours" );
	endif; 
	
EndProcedure 

Procedure checkFuelEquipment ( CheckedAttributes )
	
	if ( ExpenseEquipment <> 0
		or EquipmentWorkTime <> 0 ) then
		CheckedAttributes.Add ( "FuelEquipment" );
	endif; 
	
EndProcedure 

Procedure checkFuelOther ( CheckedAttributes )
	
	if ( OtherFuelExpense <> 0 ) then
		CheckedAttributes.Add ( "FuelOther" );
	endif; 
	
EndProcedure 

Procedure checkAccount ( CheckedAttributes )
	
	if ( FuelInventory ) then
		CheckedAttributes.Add ( "Account" );
	endif; 
	
EndProcedure 

Procedure Posting ( Cancel, PostingMode )
	
	env = Posting.GetParams ( Ref, RegisterRecords );
	env.Realtime = Realtime;
	Cancel = not Documents.Waybill.Post ( env );
	
EndProcedure

#endif
